<?php

use yii\db\Migration;

/**
 * Class m260313_084300_seed_budget_transactions_14_2569
 */
class m260313_084300_seed_budget_transactions_14_2569 extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('{{%budget_transactions}}', ['allocation_id', 'transaction_date', 'activity_name', 'requester', 'proposed_amount', 'cost_compensation', 'cost_accommodation', 'cost_materials', 'cost_hospitality', 'cost_transportation', 'reference_no'], [
            [14, '2025-10-10', 'ค่าล่วงเวลา Tcas 69 รอบ 1.1', 'ธีรนันท์', 600.0, 0.0, 0.0, 0.0, 600.0, 0.0, null],
            [14, '2025-10-10', 'ค่าล่วงเวลา Tcas 69 รอบ 1.1', 'ณัฐพล', 550.0, 0.0, 0.0, 0.0, 550.0, 0.0, null],
            [14, '2025-10-10', 'ค่าล่วงเวลา Tcas 69 รอบ 1.1', 'พรรณวดี', 400.0, 0.0, 0.0, 0.0, 400.0, 0.0, null],
            [14, '2025-10-16', 'ค่าใช้จ่ายสัมภาษณ์ Tcas 69 รอบ 1.1', 'ธีรนันท์', 8439.0, 0.0, 0.0, 8439.0, 0.0, 0.0, '1434/69'],
            [14, '2025-11-09', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 1.2', 'ธีรนันท์', 550.0, 0.0, 0.0, 0.0, 550.0, 0.0, '2569/0221'],
            [14, '2025-11-09', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 1.2', 'ประจักษ์', 550.0, 0.0, 0.0, 0.0, 550.0, 0.0, null],
            [14, '2025-11-09', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 1.2', 'พรรณวดี', 350.0, 0.0, 0.0, 0.0, 350.0, 0.0, null],
            [14, '2025-11-11', 'ค่าใช้จ่ายสัมภาษณ์ Tcas 69 รอบ 1.2', 'ธีรนันท์', 6753.0, 0.0, 0.0, 6753.0, 0.0, 0.0, '1617/69'],
            [14, '2025-12-15', 'ค่าใช้จ่ายสัมภาษณ์ Tcas 69 รอบ 1.3', 'ธีรนันท์', 9129.0, 0.0, 0.0, 9129.0, 0.0, 0.0, '1726/69'],
            [14, '2025-12-19', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 69 รอบ 1.3', 'ธีรนันท์', 200.0, 0.0, 0.0, 0.0, 200.0, 0.0, '2569/0436'],
            [14, '2025-12-19', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 69 รอบ 1.3', 'พรรณวดี', 350.0, 0.0, 0.0, 0.0, 350.0, 0.0, null],
            [14, '2025-12-19', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 69 รอบ 1.3', 'เกียรติศักดิ์', 550.0, 0.0, 0.0, 0.0, 550.0, 0.0, '2569/0449'],
            [14, '2026-01-15', 'ค่าใช้จ่ายสัมภาษณ์ Tcas 69 รอบ 1.4', 'ธีรนันท์', 9309.0, 0.0, 0.0, 9309.0, 0.0, 0.0, '92/69'],
            [14, '2026-01-23', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 69 รอบ 1.3', 'เกียรติศักดิ์', 500.0, 0.0, 0.0, 0.0, 500.0, 0.0, '2569/0699'],
            [14, '2026-01-23', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 69 รอบ 1.3', 'ธีรนันท์', 200.0, 0.0, 0.0, 0.0, 200.0, 0.0, '2569/0699'],
            [14, '2026-02-25', 'ค่าใช้จ่ายสัมภาษณ์ Tcas 69 รอบ 1.5', 'ธีรนันท์', 6573.0, 0.0, 0.0, 6573.0, 0.0, 0.0, '298/69'],
            [14, '2026-02-27', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 69 รอบ 1.5', 'ธีรนันท์', 550.0, 0.0, 0.0, 0.0, 550.0, 0.0, '2569/0978'],
            [14, '2026-02-27', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 69 รอบ 1.5', 'พงศ์สุวรรณ', 550.0, 0.0, 0.0, 0.0, 550.0, 0.0, null],
            [14, '2026-02-27', 'ค่าล่วงเวลาสัมภาษณ์ Tcas 69 รอบ 1.5', 'พรรณวดี', 350.0, 0.0, 0.0, 0.0, 350.0, 0.0, null],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->delete('{{%budget_transactions}}', ['allocation_id' => 14]);
    }
}
