<?php

use yii\db\Migration;

/**
 * Class m260313_082400_seed_budget_transactions_2569
 */
class m260313_082400_seed_budget_transactions_2569 extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('{{%budget_transactions}}', ['allocation_id', 'transaction_date', 'activity_name', 'requester', 'proposed_amount', 'cost_compensation', 'cost_accommodation', 'cost_materials', 'cost_hospitality', 'cost_transportation', 'reference_no'], [
            [11, '2025-10-08', 'ค่าเบี้ยเลี้ยง ป.สูติ ภาค1/68', 'อ.วรรณา', 1080.0, 0.0, 0.0, 0.0, 1080.0, 0.0, '1376/69'],
            [11, '2025-10-08', 'ค่าเบี้ยเลี้ยง ป.ผู้ใหญ่ ภาค1/68', 'อ.ทิพวรรณ', 360.0, 0.0, 0.0, 0.0, 360.0, 0.0, '1374/69'],
            [11, '2025-10-09', 'ค่าตอบแทนพยาบาลพี่เลี้ยง ภาค1/68 พว.อัมไพวรรณ ป.เด็ก', 'เบิกตรง', 2400.0, 2400.0, 0.0, 0.0, 0.0, 0.0, '1383/69'],
            [11, '2025-10-09', 'ค่าตอบแทนพยาบาลพี่เลี้่ยง ภาค1/68 พว.จันทร์จิรา ป.ผู้ใหญ่', 'เบิกตรง', 2800.0, 2800.0, 0.0, 0.0, 0.0, 0.0, '1379/68'],
            [11, '2025-10-09', 'ค่าตอบแทนพยาบาลพี่เลี้่ยง ภาค1/68 ผศ.ดร.กัลยา ป.สูติ', 'เบิกตรง', 4800.0, 4800.0, 0.0, 0.0, 0.0, 0.0, '1382/68'],
            [11, '2025-10-09', 'ค่าตอบแทนพยาบาลพี่เลี้่ยง ภาค1/68 พว.พัชริดา พว.ปิยะนุช ป.สูติ', 'เบิกตรง', 7400.0, 7400.0, 0.0, 0.0, 0.0, 0.0, '1381/68'],
            [11, '2025-10-09', 'ค่าตอบแทนพยาบาลพี่เลี้่ยง ภาค1/68 พว.นฤมล  ป.สูติ', 'เบิกตรง', 4200.0, 4200.0, 0.0, 0.0, 0.0, 0.0, '1380/68'],
            [11, '2025-10-16', 'ค่าตอบแทนพยาบาลพี่เลี้่ยง ภาค1/68 พว.นฤมล  ป.สูติ', 'เบิกตรง', 4200.0, 4200.0, 0.0, 0.0, 0.0, 0.0, '1391/68'],
            [11, '2025-10-16', 'ค่าตอบแทนพยาบาลพี่เลี้่ยง ภาค1/68 พว.ณัฐชยา  สุขศิริ', 'เบิกตรง', 600.0, 600.0, 0.0, 0.0, 0.0, 0.0, '1390/68'],
            [11, '2025-10-20', 'ค่าใช้จ่าย อ.จอม รายวิชา ป.ผู้ใหญ่ 1-3 ตค 68', 'อ.จอม', 3629.0, 0.0, 1404.0, 0.0, 1080.0, 1145.0, '1469/69'],
            [11, '2025-10-20', 'ค่าใช้จ่าย อ.นวรัตน์ รายวิชา ป.ผู้ใหญ่ 1-3 ตค.68', 'อ.นวรัตน์', 2945.0, 0.0, 0.0, 0.0, 2945.0, 0.0, '1468/69'],
            [11, '2025-11-06', 'ค่าใช้จ่าย อ.จิราวรรณ รายวิชา ป.สูติ', 'อ.จิราวรรณ', 2350.0, 2350.0, 0.0, 0.0, 1080.0, 1270.0, '1552/69'],
            [11, '2025-11-12', 'ค่าใช้จ่าย ป.ชุมชน ค่าวัสดุ', 'อ.สิทธิพรรณ', 4050.0, 0.0, 0.0, 0.0, 4050.0, 0.0, '1583/69'],
            [11, '2025-11-17', 'ค่าตอบแทนอสม. ป.ชุมชน ภาค2/68 ยะมิละ วรรณา มาริสา', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '1589/69'],
            [11, '2025-11-17', 'ค่าตอบแทนอสม. ป.ชุมชน ภาค2/68 ภิญญา อำนวย มณฑา จิราวรรณ', 'เบิกตรง', 1200.0, 1200.0, 0.0, 0.0, 0.0, 0.0, '1590/69'],
            [11, '2025-11-17', 'ค่าตอบแทนอสม. ป.ชุมชน ภาค2/68 อัจฉรา กานดา', 'เบิกตรง', 600.0, 600.0, 0.0, 0.0, 0.0, 0.0, '1592/69'],
            [11, '2025-11-17', 'ค่าตอบแทนอสม. ป.ชุมชน ภาค2/68', 'เบิกตรง', 600.0, 600.0, 0.0, 0.0, 0.0, 0.0, '1593/69'],
            [11, '2025-11-28', 'ค่าตอบแทน อสม. ป.ชุมชน ภาค2/68 ชนิษฎา', 'เบิกตรง', 300.0, 600.0, 0.0, 0.0, 0.0, 0.0, '1650/69'],
            [11, '2025-11-28', 'ค่าตอบแทน อสม. ป.ชุมชน ภาค2/68 ขวันจิตร อารีหย๊ะ สุนิตา', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '1651/69'],
            [11, '2025-11-28', 'ค่าตอบแทน อสม. ป.ชุมชน ภาค2/68 มาลี รุจิรา ยุวดี', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '1652/69'],
            [11, '2025-11-28', 'ค่าตอบแทน อสม. ป.ชุมชน ภาค2/68 เจนจิรา', 'เบิกตรง', 300.0, 300.0, 0.0, 0.0, 0.0, 0.0, '1653/69'],
            [11, '2025-11-28', 'ค่าตอบแทน อสม. ป.ชุมชน ภาค2/68 ดาวน้อย เสาวภา สุวิภา จุฬาภรณ์', 'เบิกตรง', 1200.0, 1200.0, 0.0, 0.0, 0.0, 0.0, '1654/69'],
            [11, '2025-12-11', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 จุรีพร สมจิต อำนวย เพ็ญศรี', 'เบิกตรง', 1200.0, 1200.0, 0.0, 0.0, 0.0, 0.0, '1692/69'],
            [11, '2025-12-11', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 อมรรัตน์ มยุรี ยุภาภรณ์', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '1691/69'],
            [11, '2025-12-11', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 ระบาย', 'เบิกตรง', 300.0, 300.0, 0.0, 0.0, 0.0, 0.0, '1690/69'],
            [11, '2025-12-11', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 สุวรรณ์', 'เบิกตรง', 300.0, 300.0, 0.0, 0.0, 0.0, 0.0, '1689/69'],
            [11, '2025-12-11', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 จรวย อรัญญา จันทนี', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '1694/69'],
            [11, '2025-12-11', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 รัตนาภรณ์', 'เบิกตรง', 300.0, 300.0, 0.0, 0.0, 0.0, 0.0, '1693/69'],
            [11, '2025-12-15', 'ค่าตอบแทน อสม. ป.ชุมชน ภาค 2/68 สะบีเยาะ นันทิการน วันเพ็ญ กุหลาบ', 'เบิกตรง', 1200.0, 1200.0, 0.0, 0.0, 0.0, 0.0, '1718/69'],
            [11, '2025-12-18', 'ค่าตอบแทน อสม. ป.ชุมชน ภาค 2/68 สะณี มาเรียม ณัฐพร ญาดา', 'เบิกตรง', 1200.0, 1200.0, 0.0, 0.0, 0.0, 0.0, '1738/69'],
            [11, '2025-12-23', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 ภัททิยา สายชล สุภาภรณ์ จุรีย์', 'เบิกตรง', 1200.0, 1200.0, 0.0, 0.0, 0.0, 0.0, '1760/69'],
            [11, '2025-12-25', 'ค่าล่วงเวลาพนักงานห้อง lab วิชากายวิภาค', 'เบิกตรง', 200.0, 0.0, 0.0, 0.0, 200.0, 0.0, '2569/0216'],
            [11, '2025-12-25', 'ค่าล่วงเวลาพนักงานห้อง lab วิชากายวิภาค', 'เบิกตรง', 800.0, 0.0, 0.0, 0.0, 800.0, 0.0, '2569/0402'],
            [11, '2025-12-25', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 พนิดา จิระนันท์', 'เบิกตรง', 600.0, 600.0, 0.0, 0.0, 0.0, 0.0, '1780/69'],
            [11, '2025-12-25', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 สุทธินี สุภารัตน์', 'เบิกตรง', 600.0, 600.0, 0.0, 0.0, 0.0, 0.0, '1779/69'],
            [11, '2025-12-25', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 อุไรวรรณ พรพิมล สำราญ', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '1778/69'],
            [11, '2025-12-25', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 สมร', 'เบิกตรง', 300.0, 300.0, 0.0, 0.0, 0.0, 0.0, '1777/69'],
            [11, '2025-12-25', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 จุฑาธิป ขวัญใจ', 'เบิกตรง', 600.0, 0.0, 0.0, 0.0, 0.0, 0.0, '1776/69'],
            [11, '2025-12-25', 'ค่าตอบแทน อสม.ป.ชุมชน ภาค2/68 ศิริวรรณ  วิไล', 'เบิกตรง', 600.0, 0.0, 0.0, 0.0, 0.0, 0.0, '1775/69'],
            [11, '2025-12-30', 'ค่าตอบแทนแหล่งฝึก วิชา ป.การจัดการ ภาค2/68 มหาราช 8000 ศกพ.6000 ท่าศาลา 10000', 'เบิกตรง', 24000.0, 0.0, 0.0, 0.0, 0.0, 0.0, '1810/69'],
            [11, '2026-01-07', 'ค่าล่วงเวลาพนักงานห้องlab วิชาการผดุงครรภ์ อุไรวรรณ 450 กมลวรรณ 450', 'เบิกตรง', 900.0, 0.0, 0.0, 0.0, 900.0, 0.0, '2569/0556'],
            [11, '2026-01-07', 'ค่าล่วงเวลาพนักงานห้อง lab วิชาบำบัดพื้นฐาน นิภาพร 450', 'เบิกตรง', 450.0, 0.0, 0.0, 0.0, 450.0, 0.0, '2569/0218'],
            [11, '2026-01-09', 'ค่าตอบแทน อสม. ป.ชุมชน รูสนี/พัศมัย', 'เบิกตรง', 600.0, 600.0, 0.0, 0.0, 0.0, 0.0, '55/69'],
            [11, '2026-01-09', 'ค่าตอบแทน อสม. ป.ชุมชน ประไพ', 'เบิกตรง', 300.0, 300.0, 0.0, 0.0, 0.0, 0.0, '56/69'],
            [11, '2026-01-09', 'ค่าตอบแทน อสม. ป.ชุมชน ลดาวัลย์/ปิยภรณ์/มลิวัลย์', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '57/69'],
            [11, '2026-01-09', 'ค่าตอบแทน อสม. ป.ชุมชน ทัศนีย์/ภิรมย์/แสงมณี/อภิสรา', 'เบิกตรง', 1200.0, 1200.0, 0.0, 0.0, 0.0, 0.0, '58/69'],
            [11, '2026-01-09', 'ค่าตอบแทน อสม. ป.ชุมชน วรรณา/สุผะ/ปราณี', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '59/69'],
            [11, '2026-01-09', 'ค่าตอบแทน อสม. ป.ชุมชน สุวรรณี', 'เบิกตรง', 300.0, 300.0, 0.0, 0.0, 0.0, 0.0, '60/69'],
            [11, '2026-01-09', 'ค่าตอบแทน อสม. ป.ชุมชน จุรีย์/จินตนา', 'เบิกตรง', 600.0, 600.0, 0.0, 0.0, 0.0, 0.0, '61/69'],
            [11, '2026-01-09', 'ค่าตอบแทน อสม. ป.ชุมชน ณัฐพร/ญาดา/สะณีย์/มาเรียม', 'เบิกตรง', 1200.0, 1200.0, 0.0, 0.0, 0.0, 0.0, '62/69'],
            [11, '2026-01-15', 'ค่าตอบแทน อสม. ป.ชุมชน สุนีย์ / สาผรียะ / ประภัสสร', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '78/69'],
            [11, '2026-01-15', 'ค่าตอบแทน อสม. ป.ชุมชน จันทร์เพ็ญ', 'เบิกตรง', 300.0, 300.0, 0.0, 0.0, 0.0, 0.0, '82/69'],
            [11, '2026-01-15', 'ค่าตอบแทน อสม. ป.ชุมชน ณิชาดา/สุฏาวรา/รอสุหนีะ/กานดา', 'เบิกตรง', 1200.0, 1200.0, 0.0, 0.0, 0.0, 0.0, '84/69'],
            [11, '2026-01-15', 'ค่าตอบแทน อสม. ป.ชุมชน ธีวิน', 'เบิกตรง', 300.0, 300.0, 0.0, 0.0, 0.0, 0.0, '86/69'],
            [11, '2026-01-15', 'ค่าตอบแทน อสม. ป.ชุมชน ธราภรณ์ / เพ็ญนิภา / จิราภรณ์', 'เบิกตรง', 900.0, 900.0, 0.0, 0.0, 0.0, 0.0, '86/69'],
            [11, '2026-01-23', 'ค่าล่วงเวลาพนักงานห้อง lab ป.รักษาโรคเบื้องต้น', 'เบิกตรง', 2000.0, 0.0, 0.0, 0.0, 2000.0, 0.0, '2569/0707'],
            [11, '2026-01-26', 'ค่าตอบแทนแหล่งฝึก ป.พยาบาลชุมชน ภาค 2/68', 'เบิกตรง', 16000.0, 16000.0, 0.0, 0.0, 0.0, 0.0, '155/69'],
            [11, '2026-01-26', 'ค่าตอบแทนสัมผัสร่างอาจารย์ใหญ่ ภาค 2/68 ครั้งที่ 1 ธค 68', 'เบิกตรง', 9000.0, 9000.0, 0.0, 0.0, 0.0, 0.0, null],
            [11, '2026-01-29', 'ค่าใช้จ่ายรายวิชา ป.รักษาโรคเบื้องต้น ภาค2/68', 'อ.พรชนุตร', 855.0, 0.0, 0.0, 855.0, 0.0, 0.0, '191/69'],
            [11, '2026-01-30', 'ค่าตอบแทนสัมผัสร่างอาจารย์ใหญ่ ภาค 2/68 ครั้งที่ 2 มค 69', 'เบิกตรง', 4500.0, 4500.0, 0.0, 0.0, 0.0, 0.0, '195/69'],
            [11, '2026-01-30', 'ค่าล่วงเวลา พนักงานห้อง lab  - อุไรวรรณ', 'เบิกตรง', 250.0, 250.0, 0.0, 0.0, 0.0, 0.0, '2569/0216'],
            [11, '2026-01-30', 'ค่าใช้จ่ายวิชา ป.ชุมชน', 'พรรณวดี', 2354.0, 0.0, 0.0, 2354.0, 0.0, 0.0, '197/69'],
            [11, '2026-02-09', 'ค่าใช้จ่ายวิชาก ป.รักษาโรคเบื้องต้น ภาค2/68', 'พรชนุตร', 976.0, 0.0, 0.0, 976.0, 0.0, 0.0, '225/69'],
            [11, '2026-02-11', 'ค่าตอบแทนสัมผัสร่างอาจารย์ใหญ่ ภาค 2/68 ครั้งที่ 3 กพ 69', 'เบิกตรง', 4500.0, 4500.0, 0.0, 0.0, 0.0, 0.0, '221/69'],
            [11, '2026-02-24', 'ค่าใช้จ่ายรายวิชา ป.รักษาโรค ภาค2/68', 'พรรณวดี', 1920.0, 0.0, 0.0, 1920.0, 0.0, 0.0, '297/69'],
            [11, '2026-02-24', 'ค่าใช้จ่ายรายวิชา ป.รักษาโรค ภาค2/68', 'พรชนุตร', 872.0, 0.0, 0.0, 872.0, 0.0, 0.0, '296/69'],
            [11, '2026-02-27', 'ค่าล่วงเวลา พ.ห้อง lab วิชากายวิภาค', 'เบิกตรง', 200.0, 200.0, 0.0, 0.0, 0.0, 0.0, '2569/0216'],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->delete('{{%budget_transactions}}', ['allocation_id' => 11]);
    }
}
