<?php

use yii\db\Migration;

class m260311_100000_seed_innovation_data extends Migration
{
    public function safeUp()
    {
        $this->insert('{{%innovations}}', [
            'name' => 'ถุงเท้ากันน้ำ ป้องกันการติดเชื้อของแผลในผู้ป่วยเบาหวาน',
            'invention_date' => '2020-10-31',
            'problem' => 'จากการศึกษาค้นคว้างานวิชาการที่ผ่านมาพบว่าผู้ป่วยเบาหวานที่มีแผลที่เท้าส่วนใหญ่มีการติดเชื้อจนส่งผลให้มีการตัดขาตามมา ซึ่งสาเหตุส่วนใหญ่เกิดจากการดูแลแผลที่ไม่เหมาะสม และจากการได้ลงฝึกปฏิบัติการพยาบาลอนามัยชุมชนในหมู่ 11 ต.โมคลาน อ.ท่าศาลา จ.นครศรีธรรมราช',
            'process' => "1. ประชุมวางแผน หารือแนวทางการดำเนินการ \n2. ประสานผู้นำชุมชนในการทำเวทีประชาคม",
            'results' => 'ผู้ป่วยเบาหวานทุคนที่ยังไม่เกิดแผลที่เท้าใช้นวัตกรรมถุงเท้ากันน้ำแล้วไม่เกิดแผลที่เท้า ผู้เข้าร่วมโครงงานมีความพึงพอใจในการใช้นวัตกรรมในการดูแลเท้าเพื่อป้องกันแผลและ แผลติดเชื้อ ร้อยละ 100',
            'advisor' => 'ผู้ช่วยศาสตราจารย์ กำไล สมรักษ์',
            'developers' => "1. นางสาวนัจลาอ์ หมาดหมีน \n2. นางสาวจุฑารัตน์ ดอเสาะ \n3. นางสาวอรปรียานุช น้ำทอง \n4. นางสาวนูรฮาซีกิง บินสาและ \n5. นางสาวอาซีซ๊ะ ดอเลาะ \n6. นางสาวตัซลีมา เจ๊ะแว",
            'latitude' => 8.647311,
            'longitude' => 99.897486,
        ]);
    }

    public function safeDown()
    {
        $this->delete('{{%innovations}}', ['name' => 'ถุงเท้ากันน้ำ ป้องกันการติดเชื้อของแผลในผู้ป่วยเบาหวาน']);
    }
}
