<?php

use yii\db\Migration;

class m260313_075831_import_budget_disbursements_2569 extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $allocation_id = 9;
        $data = [
            ['2025-10-08', 'คชจ.รายวิชาบูรณาการพยาธิฯ ภาค 1/68', 'อ.กล้าเผชิญ', 4100.00, 0, 0, 0.00, 4100.00, 0, ''],
            ['2025-10-30', 'ค่าล่วงเวลา พขร. กิจกรรมวันพยาบาลแห่งชาติ', 'พรรณวดี', 200.00, 0, 0, 0.00, 200, 0, '1505/69'],
            ['2025-10-31', 'ค่าล่วงเวลาพนักงานห้อง lab วิชา ประเมิน', 'ธีรนันท์', 400.00, 0, 0, 0.00, 400, 0, '2569/5101'],
            ['2025-10-31', 'ค่าล่วงเวลาพนักงานห้อง lab วิชา ประเมิน', 'ธีรนันท์', 3100.00, 0, 0, 0.00, 3100, 0, '2569/5100'],
            ['2025-10-31', 'ค่าใช้จ่ายวันพยาบาลแห่งชาติ', 'พรรณวดี', 18003.60, 0, 0, 0.00, 0, 0, '1522/69'],
            ['2025-11-11', 'ค่าใช้จ่ายประชุม PLO', 'ธีรนันท์', 1040.00, 0, 0, 0.00, 1040, 0, '1615/68'],
            ['2025-11-28', 'ค่าใช้จ่ายเสริมหลักสูตร ป.ตรี วิชา ป.ชุมชน', 'พรรณวดี', 6481.00, 0, 0, 6481.00, 0, 0, '1657/68'],
            ['2025-11-28', 'ค่าใช้จ่ายประชุม PLO', 'ธีรนันท์', 600.00, 0, 0, 0.00, 600, 0, '1656/68'],
            ['2025-12-02', 'ค่าใช้จ่ายเสริมหลักสูตร ป.ชุมชน', 'พรรณวดี', 4787.00, 0, 0, 4787.00, 0, 0, '1667/68'],
            ['2025-12-03', 'ค่าใช้จ่ายเสริมหลักสูตรรายวิชา เด็ก 1', 'กนกวรรณ', 4753.00, 0, 0, 4753.00, 0, 0, '1683/69'],
            ['2025-12-04', 'ค่าใช้จ่ายเสริมหลักสูตรรายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 9806.25, 0, 0, 9806.26, 0, 0, '1686/69'],
            ['2025-12-09', 'ค่าล่วงเวลา จนท.ห้องแลป กายวิภาค', 'เบิกตรง', 300.00, 300, 0, 0.00, 0, 0, '2569/0216'],
            ['2025-12-15', 'ค่าใช้จ่ายเสริมหลักสูตรรายวิชา ป.การจัดการ ภาค2/68', 'เกียรติกำจร', 9180.00, 0, 0, 9180.00, 0, 0, '1728/69'],
            ['2025-12-15', 'ค่าใช้จ่ายเสริมหลักสูตรรายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 6792.72, 0, 0, 6792.75, 0, 0, '1727/69'],
            ['2025-12-15', 'ค่าใช้จ่ายเสริมหลักสูตรรายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 4079.00, 0, 0, 4079.00, 0, 0, '1726/69'],
            ['2025-12-15', 'ค่าใช้จ่ายเสริมหลักสูตรรายวิชา ป.การจัดการ ภาค2/68', 'ธีรนันท์', 5728.69, 0, 0, 5728.69, 0, 0, '1725/69'],
            ['2025-12-15', 'ค่าใช้จ่ายเสริมหลักสูตรรายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 7750.00, 0, 0, 7750.00, 0, 0, '1730/69'],
            ['2025-12-15', 'ค่าล่วงเวลาพนักงานสื่อโสต กิจกรรมคณบดี พบ นศ. 4 ชั้นปี', 'เบิกตรง', 250.00, 0, 0, 0.00, 250, 0, '2569/0513'],
            ['2025-12-25', 'ค่าวัสดุอุปกรณ์ รายวิชา ป.การจัดการ โครงการเสริมหลักสูตร ภาค2/68', 'ธีรนันท์', 4824.00, 0, 0, 4824.00, 0, 0, '1786/69'],
            ['2026-01-07', 'ค่าใช้จ่ายโครงการเสริมหลักสูตร รายวิชา ป.ชุมชน ภาค2/68', 'ชุติมา', 6350.00, 0, 0, 6350.00, 0, 0, '50/69'],
            ['2026-01-08', 'ค่าใช้จ่ายโครงการเสริมหลักสูตร รายวิชา ป.บูรณการ ภาค2/68', 'ชุติพร', 17100.00, 0, 0, 17100.00, 0, 0, '51/69'],
            ['2026-01-09', 'ค่าใช้จ่ายโครงการเสริมหลักสูตร รายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 2931.00, 0, 0, 2931.00, 0, 0, '66/69'],
            ['2026-01-09', 'ค่าใช้จ่ายโครงการเสริมหลักสูตร รายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 6790.75, 0, 0, 6790.75, 0, 0, '67/69'],
            ['2026-01-09', 'ค่าใช้จ่ายโครงการเสริมหลักสูตร รายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 2303.00, 0, 0, 2303.00, 0, 0, '96/69'],
            ['2026-01-09', 'ค่าใช้จ่ายโครงการเสริมหลักสูตร รายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 6600.00, 0, 0, 6600.00, 0, 0, '95/69'],
            ['2026-01-09', 'ค่าใช้จ่ายโครงการเสริมหลักสูตร รายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 7887.34, 0, 0, 7887.34, 0, 0, '94/69'],
            ['2026-01-09', 'ค่าใช้จ่ายโครงการเสริมหลักสูตร รายวิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 9681.41, 0, 0, 9681.41, 0, 0, '93/69'],
            ['2026-01-20', 'ค่าตอบแทนล่วงเวลา พ.lab วิชา สูติ ภาค2/68', 'เบิกตรง', 900.00, 900, 0, 0.00, 0, 0, '2569/0565'],
            ['2026-01-22', 'ค่าตอบแทนล่วงเวลา พ.lab วิชา สาธารณภัย ภาค2/68', 'เบิกตรง', 2000.00, 0, 0, 0.00, 2000, 0, '2569/0418'],
            ['2026-01-29', 'ค่าใช้จ่ายโครงการวันเด็กแห่งชาติ', 'พรรณวดี', 20607.00, 0, 0, 20607.00, 0, 0, '187/69'],
            ['2026-01-29', 'ค่าใช้จ่ายโครงการเสริมหลักสูตร วิชา ป.ชุมชน ภาค2/68', 'พรรณวดี', 9036.00, 0, 0, 9036.00, 0, 0, '188/69'],
            ['2026-01-29', 'ค่าใช้จ่ายกิจกรรมเสริมหลักสูตร กิจกรรมบุญให้ทานไฟ', 'วรรณา', 9000.00, 0, 0, 6500.00, 0, 0, '192/69'],
            ['2026-02-05', 'ค่าใช้จ่ายกิจกรรมเสริมหลักสูตร ป.ชุมชน ภาค2/68', 'พรรณวดี', 2634.00, 0, 0, 2634.00, 0, 0, '216/69'],
            ['2026-02-05', 'ค่าใช้จ่ายกิจกรรมเสริมหลักสูตร วิชาศาสตร์และแนวคิดการผดุงครรภ์ ภาค2/68', 'ปฤษดาพร', 3000.00, 0, 0, 3000.00, 0, 0, '217/69'],
            ['2026-02-05', 'ค่าใช้จ่ายกิจกรรมเสริมหลักสูตร วิชา การจัดการภาวะฉุกเฉินและสาธารณภัย', 'พรรณวดี', 43415.00, 0, 0, 43415.00, 0, 0, '219/69'],
            ['2026-02-09', 'ค่าใช้จ่ายกิจกรรมเตรียมความพร้อมเพื่อสอบ ความรู้รวบยอด', 'พรรณวดี', 755.00, 0, 0, 0.00, 755, 0, '224/69'],
            ['2026-02-17', 'ค่าใช้จ่ายเสริมหลักสูตร วิชา การจัดการภาวะฉุกเฉินและสาธารณภัย', 'พรรณวดี', 47960.00, 0, 0, 45829.70, 0, 0, '252/69'],
            ['2026-02-20', 'ค่าล่วงเวลาพนักงาน รายวิชา บำบัดพื้นฐาน นิภาพร 900 อุไรวรรณ 950 กมลวรรณ 1000', 'เบิกตรง', 2850.00, 2850, 0, 0.00, 0, 0, '2569/0219'],
            ['2026-02-20', 'ค่าวัสดุอุปกรณ์รายวิชา ป.บำบัด', 'อ.เกียรติกำจร', 1575.00, 0, 0, 1575.00, 0, 0, '274/69'],
            ['2026-02-27', 'ค่าใช้จ่ายกิจกรรมเสริมหลักสูตร รายวิชา บำบัดพื้นฐานทางการพยาบาล', 'เบิกตรง', 12000.00, 12000, 0, 0.00, 0, 0, '313/69'],
            ['2026-03-11', 'ค่าใช้จ่ายเสริมหลักสูตรรายวิชา บูรณาการ ภาค2/68', 'พรรณวดี', 2300.00, 0, 0, 2300.00, 0, 0, '384/69'],
            ['2026-03-11', 'ค่าใช้จ่ายเสริมหลักสูตรรายวิชา กายวิภาค ภาค2/68', 'พรรณวดี', 6600.00, 0, 0, 6600.00, 0, 0, '383/69'],
        ];

        foreach ($data as $row) {
            $this->insert('{{%budget_transactions}}', [
                'allocation_id' => $allocation_id,
                'transaction_date' => $row[0],
                'activity_name' => $row[1],
                'requester' => $row[2],
                'proposed_amount' => $row[3],
                'cost_compensation' => $row[4],
                'cost_accommodation' => $row[5],
                'cost_materials' => $row[6],
                'cost_hospitality' => $row[7],
                'cost_transportation' => $row[8],
                'reference_no' => $row[9],
                'note' => '',
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s'),
            ]);
        }
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->delete('{{%budget_transactions}}', ['allocation_id' => 9]);
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m260313_075831_import_budget_disbursements_2569 cannot be reverted.\n";

        return false;
    }
    */
}
