<?php

use yii\db\Migration;

/**
 * Class m260313_083000_seed_budget_transactions_12_2569
 */
class m260313_083000_seed_budget_transactions_12_2569 extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('{{%budget_transactions}}', ['allocation_id', 'transaction_date', 'activity_name', 'requester', 'proposed_amount', 'cost_compensation', 'cost_accommodation', 'cost_materials', 'cost_hospitality', 'cost_transportation', 'reference_no'], [
            [12, '2025-12-03', 'ค่าตอบแทนวิทยากร วิชา ป.การจัดการ', 'เบิกตรง', 2400.0, 2400.0, 0.0, 0.0, 0.0, 0.0, '1671/69'],
            [12, '2025-12-23', 'ค่าตอบแทนวิทยากร วิชาศาสตร์และแนวคิด ภาค 2/68 พว.นฤมล  จำปา', 'เบิกตรง', 8400.0, 8400.0, 0.0, 0.0, 0.0, 0.0, '1765/69'],
            [12, '2026-01-08', 'ค่าตอบแทนวิทยากร วิชาการผดุงครรภ์ ภาค2/68 พว.นฤมล  จำปา', 'เบิกตรง', 12300.0, 12300.0, 0.0, 0.0, 0.0, 0.0, '33/69'],
            [12, '2026-01-15', 'ค่าตอบแทนวิทยากร วิชาการผดุงครรภ์ ภาค2/68 พว.นฤมล  จำปา', 'เบิกตรง', 3600.0, 3600.0, 0.0, 0.0, 0.0, 0.0, '83/69'],
            [12, '2026-01-15', 'ค่าตอบแทนวิทยากร วิชาการผดุงครรภ์ ภาค2/68 พว.นฤมล  จำปา', 'เบิกตรง', 3000.0, 3000.0, 0.0, 0.0, 0.0, 0.0, '81/69'],
            [12, '2026-01-30', 'ค่าตอบแทนวิทยากร วิชาบำบัดพื้นฐาน ภาค2/68 พว.เตชินี', 'เบิกตรง', 1800.0, 1800.0, 0.0, 0.0, 0.0, 0.0, '194/69'],
            [12, '2026-01-30', 'ค่าตอบแทนวิทยากร วิชาการผดุงครรภ์ ภาค2/68 พว.นฤมล  จำปา', 'เบิกตรง', 2400.0, 2400.0, 0.0, 0.0, 0.0, 0.0, '159/69'],
            [12, '2026-02-03', 'ค่าตอบแทนวิทยากร วิชาบำบัดพื้นฐาน ภาค2/68 พว.เตชินี', 'เบิกตรง', 3600.0, 3600.0, 0.0, 0.0, 0.0, 0.0, '203/69'],
            [12, '2026-02-23', 'ค่าตอบแทนวิทยากร วิชาการผดุงครรภ์ ภาค2/68 พว.นฤมล  จำปา', 'เบิกตรง', 9600.0, 9600.0, 0.0, 0.0, 0.0, 0.0, '284/69'],
            [12, '2026-02-27', 'ค่าตอบแทนวิทยากร วิชาบำบัดพื้นฐาน ภาค2/68 พว.นฤมล  จำปา', 'เบิกตรง', 4200.0, 4200.0, 0.0, 0.0, 0.0, 0.0, '314/69'],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->delete('{{%budget_transactions}}', ['allocation_id' => 12]);
    }
}
